void setup(){
  size(500, 600);
  smooth(8);
}

void draw(){
   background(0);
   noStroke();
   fill(65,105,225);
   triangle(220, 110, 230, 130, 255, 130);
   quad(230, 130, 255, 130, 257, 141, 220, 141);
   fill(255);
   rect(100, 150, 300, 150, 20, 20, 20, 20);
   fill(0);
   circle(150, 250, 15);
   circle(350, 250, 15);
   triangle(250, 250, 240, 265, 260, 265);
   fill(255);
   rect(200, 300, 100, 15, 0, 0 , 10, 10);
   fill(65,105,225);
   // туловище
   rect(150, 330, 200, 120);
   // руки
   rect(100, 330, 260, 20, 5);
   fill(255);
   // левая кисть
   rect(75, 330, 20, 20, 5);
   // правая кисть
   rect(365, 330, 20, 20, 5);
   // пояс
   fill(139,69,19);
   rect(150, 450, 200, 15);
   fill(255);
   // нога левая
   rect(150, 470, 55, 15, 5);
   // нога правая
   rect(295, 470, 55, 15, 5);
   fill(255,255,0);
   triangle(250, 355, 210, 420, 290, 420);
   fill(189,183,107);
   triangle(230, 385, 270, 385, 250, 420);
}
